// 🛡️ 本文件由在线管理台自动生成，请勿手动修改
export interface Music { id: string; title: string; artist: string; cover: string; src: string; lrcText: string; }
export const localMusic: Music[] = [
  {
    "id": "song1",
    "title": "晴天",
    "artist": "周杰伦",
    "cover": "https://aka.doubaocdn.com/s/dU1UfpU9mr",
    "src": "https://aka.doubaocdn.com/s/WddxIM2ET9",
    "lrcText": "[00:00.00]晴天 - 周杰伦\n[00:29.26]故事的小黄花\n[00:32.71]从出生那年就飘着\n[00:36.24]童年的荡秋千\n[00:39.75]随记忆一直晃到现在\n[00:56.71]为你翘课的那一天\n[00:58.82]花落的那一天\n[01:00.60]教室的那一间\n[01:02.32]我怎么看不见\n[01:04.12]消失的下雨天\n[01:05.81]我好想再淋一遍\n[01:24.90]刮风这天我试过握着你手\n[01:30.45]但偏偏雨渐渐大到我看你不见\n[01:38.88]还要多久我才能在你身边\n[01:45.43]等到放晴的那天也许我会比较好一点\n[01:52.86]从前从前有个人爱你很久\n[01:58.54]但偏偏风渐渐把距离吹得好远\n[02:06.93]好不容易又能再多爱一天\n[02:13.50]但故事的最后你好像还是说了拜拜"
  },
  {
    "id": "song2",
    "title": "花海",
    "artist": "周杰伦",
    "cover": "https://aka.doubaocdn.com/s/dU1UfpU9mr",
    "src": "https://aka.doubaocdn.com/s/AYI72AHMXA",
    "lrcText": "[00:00.00]花海 - 周杰伦\n[00:27.23]静止了 所有的花开\n[00:33.56]遥远了 清晰了爱\n[00:39.90]天郁闷 爱却很喜欢\n[00:46.32]那时候我不懂这叫爱\n[00:52.70]你喜欢 站在那窗台\n[00:59.02]你好久 都没再来\n[01:05.43]彩色的时间染上空白\n[01:12.79]是你流的泪晕开\n[01:17.52]不要你离开\n[01:20.71]距离隔不开\n[01:23.93]思念变成海\n[01:26.72]在窗外进不来\n[01:30.34]原谅说太快\n[01:33.54]爱成了阻碍\n[01:36.71]手中的风筝放太快回不来\n[01:55.92]天空仍灿烂\n[01:59.06]它爱着大海\n[02:02.31]情歌被打败\n[02:05.57]爱已不存在"
  },
  {
    "id": "song3",
    "title": "遇见",
    "artist": "孙燕姿",
    "cover": "https://aka.doubaocdn.com/s/OfpcTrwIio",
    "src": "https://aka.doubaocdn.com/s/142RVPV6hr",
    "lrcText": "[00:00.00]遇见 - 孙燕姿\n[00:24.76]听见 冬天的离开\n[00:29.85]我在某年某月 醒过来\n[00:35.43]我想 我等 我期待\n[00:40.17]未来却不能因此安排\n[00:54.00]阴天 傍晚 车窗外\n[00:59.02]未来有一个人在等待\n[01:04.48]向左向右向前看\n[01:09.59]爱要拐几个弯才来\n[01:14.72]我遇见谁 会有怎样的对白\n[01:19.95]我等的人 他在多远的未来\n[01:25.29]我听见风来自地铁和人海\n[01:30.43]我排着队 拿着爱的号码牌\n[02:43.54]我往前飞 飞过一片时间海\n[02:48.78]我们也曾在爱情里受伤害\n[02:53.97]我看着路 梦的入口有点窄\n[02:59.18]我遇见你是最美丽的意外\n[03:06.05]总有一天 我的谜底会揭开"
  },
  {
    "id": "song4",
    "title": "红色高跟鞋",
    "artist": "蔡健雅",
    "cover": "https://aka.doubaocdn.com/s/pSNLKkfEF4",
    "src": "https://aka.doubaocdn.com/s/2OeBcqACEx",
    "lrcText": "[00:00.00]红色高跟鞋 - 蔡健雅\n[00:22.75]该怎么去形容你最贴切\n[00:28.15]拿什么跟你作比较才算特别\n[00:33.60]对你的感觉 强烈\n[00:36.31]却又不太了解 只凭直觉\n[00:42.68]你像窝在被子里的舒服\n[00:47.90]却又像风捉摸不住\n[00:53.10]像手腕上散发的香水味\n[00:58.74]像爱不释手的 红色高跟鞋\n[02:36.65]我爱你有种左灯右行的冲突\n[02:42.49]疯狂却怕没有退路\n[02:47.56]你能否让我停止这种追逐\n[02:53.76]就当那双 最后唯一的\n[02:58.58]红色高跟鞋"
  },
  {
    "id": "song5",
    "title": "我不难过",
    "artist": "孙燕姿",
    "cover": "https://aka.doubaocdn.com/s/OfpcTrwIio",
    "src": "https://aka.doubaocdn.com/s/jEXOjiFXNd",
    "lrcText": "[00:00.00]我不难过 - 孙燕姿\n[00:31.28]又站在你家的门口我们重复沉默\n[00:37.40]这样子单方面的守候还能多久\n[00:46.25]终于你开口向我诉说她有多温柔\n[00:52.70]虽然你还握着我的手\n[00:56.49]但我已不在你心中\n[01:01.60]我真的懂你不是喜新厌旧\n[01:08.60]是我没有\n[01:11.82]陪在你身边当你寂寞时候\n[01:23.64]我不难过这不算什么\n[01:26.96]只是为什么眼泪会流我也不懂\n[01:31.23]就让我走让我开始享受自由\n[01:46.93]我并不懦弱你比谁都懂\n[01:53.52]这会是我最后的宽容\n[04:22.86]不要再说或许这是最好的结果\n[04:30.04]现在分手\n[04:33.06]总好过你不爱我一拖再拖\n[04:38.51]松开你的手离开你左右\n[04:43.37]我向前走这会是我真正的解脱"
  }
];
